Tekla Open API Reference for Tekla Structures 2025
FacetedBrepFaceHole.Vertices Property
 Gets the vertices.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<Vector> Vertices { get; }
Public ReadOnly Property Vertices As IList(Of Vector)
	Get
Property Value
Type: IList<Vector>
See Also
Reference
FacetedBrepFaceHole Class
Tekla.Structures.Geometry3d Namespace